In [1]:
import pandas as pd
names=['Ramesh','suresh','ram']
data=pd.DataFrame(names)
data

        0
0  Ramesh
1  suresh
2     ram

In [9]:
import pandas as pd
names=['Ramesh','suresh','ram']
age=[21,33,45]
city=['pune','mum','hyd']
data=pd.DataFrame(zip(city,names, age))
data

      0       1   2
0  pune  Ramesh  21
1   mum  suresh  33
2   hyd     ram  45

In [11]:
import pandas as pd
names=['Ramesh','suresh','ram']
age=[21,33,45]
city=['pune']
data=pd.DataFrame((city,names, age))
data

        0       1     2
0    pune    None  None
1  Ramesh  suresh   ram
2      21      33    45

In [15]:
import pandas as pd
names=['Ramesh','suresh','ram']
age=[21,33,45]
city=['pune']
cols=['Names','Age','City']
data=pd.DataFrame((names, age, city),
                 columns=cols)
data

    Names     Age  City
0  Ramesh  suresh   ram
1      21      33    45
2    pune    None  None

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [18]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [20]:
import pandas as pd
names=['Ramesh','suresh','ram']
age=[21,33,45]
city=['pune']
cols=['NAMES','AGE','CITY']
data=pd.DataFrame((names, age, city),
                 columns=cols)
data

    NAMES     AGE  CITY
0  Ramesh  suresh   ram
1      21      33    45
2    pune    None  None

In [ ]:
# Step # 5 Updating your own index

In [22]:
import pandas as pd
names=['Ramesh','suresh','ram']
age=[21,33,45]
city=['pune']
cols=['NAMES','AGE','CITY']
ids=['A','B','C']
data=pd.DataFrame((names, age, city),
                  index=ids,
                 columns=cols)
data

    NAMES     AGE  CITY
A  Ramesh  suresh   ram
B      21      33    45
C    pune    None  None

In [36]:
# Step 6 Add new column to existing DF
import pandas as pd
names=['Ramesh','suresh','ram']
age=[21,33,45]
city=['pune']
cols=['NAMES','AGE','CITY']
data=pd.DataFrame((names, age, city),
                 columns=cols)
data
# New column should hv as much columns as rows
marks=[100,200,300]
data['MARKS']=marks
data1=data
data1
sub=['math','phy','che']
# data1['SUBJECT']=sub
data1['SUBJECT1']=sub
data2=data1
data2

    NAMES     AGE  CITY  MARKS SUBJECT1
0  Ramesh  suresh   ram    100     math
1      21      33    45    200      phy
2    pune    None  None    300      che

In [3]:
# Step 7 From empty DF i want to add the rows
import pandas as pd
names=['Ramesh','suresh','ram']
age=[21,33,45]
city=['pune','mum','hyd']
cols=['NAMES','AGE','CITY']
df1=pd.DataFrame()
df1['Names']=names
df1['Age']=age
df1['city']=city
df1

    Names  Age  city
0  Ramesh   21  pune
1  suresh   33   mum
2     ram   45   hyd

In [7]:
import pandas as pd
#Step 8- Renaming column
df1=pd.DataFrame()
df1['Names']=names
df1['Age']=age
df1['city']=city
dict1={'city':'CITY'}
df2=df1.rename(columns=dict1)
df2
# df1 -- Overiding is not happenning
# if you want to replace it then 'inplace = true'
df1.rename(columns=dict1, inplace=True)
df1

    Names  Age  CITY
0  Ramesh   21  pune
1  suresh   33   mum
2     ram   45   hyd

In [112]:
#Step 8- Renaming column
df1=pd.DataFrame()
df1['Names']=names
df1['Age']=age
df1['city']=city
dict1={'city':'CITY'}
# df2=df1.rename(columns=dict1)
df2
# df1 -- Overiding is not happenning
# if you want to replace it then 'inplace = true'
df1.rename(columns=dict1, inplace=True)
df1
df1['Age']=[61,62,63]
df1['True Age']=[81,82,83]

df1

    Names  Age  CITY  True Age
0  Ramesh   61  pune        81
1  suresh   62   mum        82
2     ram   63   hyd        83

In [68]:
# *** Apply Method ***
# - Used to Update column values, use lambda function, take column and use apply method

SyntaxError: invalid syntax (3396422272.py, line 1)

In [9]:
func=lambda x:x*2
df1['Age']=df1['Age'].apply(func)
df1

    Names  Age  city
0  Ramesh   42  pune
1  suresh   66   mum
2     ram   90   hyd

In [17]:
data=pd.DataFrame()
data['price']=[10,20,30]
data['quantity']=[11,22,33]
f=lambda x:x['price']*x['quantity']
data['cost']=data.apply(f,axis=1)
data

   price  quantity  cost
0     10        11   110
1     20        22   440
2     30        33   990

In [13]:
# Case # 2 how to replace specific value, replace method
# df1['Age'].replace(12,0, inplace=True) # 
df2=df1['Age'].replace(12) # 
df2

C:\Users\ramka\AppData\Local\Temp\ipykernel_18188\3103750508.py:3: FutureWarning: Series.replace without 'value' and with non-dict-like 'to_replace' is deprecated and will raise in a future version. Explicitly specify the new values instead.
  df2=df1['Age'].replace(12) #

0    21
1    33
2    45
Name: Age, dtype: int64

In [27]:
# Step 10 - How to drop a column
# Axis parameter tells if its column or row
# axis=0 indicates row, This is default value...
# axis=1 indicates columns
# Use inplace to overide the dataframe
df1.drop('True Age', axis=1, inplace=True)
df1

KeyError: "['True Age'] not found in axis"

In [106]:
df1.drop(index=0,axis=0,inplace=True)
df1

    Names  Age CITY
1  suresh  124  mum
2     ram  126  hyd

In [118]:
df1
df2=df1.drop(columns='True Age')
df2

    Names  Age  CITY
0  Ramesh   61  pune
1  suresh   62   mum
2     ram   63   hyd

In [132]:
# Step # 12 Create DF using dictionary
names
# age
dict1={'Names':['Ramesh', 'suresh', 'ram'],
       'Age':[21,31,41]}
dict1
pd.DataFrame(dict1)

    Names  Age
0  Ramesh   21
1  suresh   31
2     ram   41

In [150]:
# Step # 12 Create DF using dictionary
names
# age
dict1={'Names':['Ramesh', 'suresh', 'ram'],
       'Age':[21,31,41]}
dict1
dfdict=pd.DataFrame(dict1)
import os
# DF can be saved in csv or xlsx
dfdict.to_csv(r'C:\Users\ramka\test.csv')
dfdict.to_csv('test.csv')
dfdict.to_excel(r'C:\Users\ramka\OneDrive - Atyeti Inc\Desktop\data.xlsx', index=False)

In [29]:
# Step 14: How to read DF
readdf=pd.read_csv(r'C:\Users\ramka\test.csv')
readxls=pd.read_excel(r'C:\Users\ramka\OneDrive - Atyeti Inc\Desktop\data.xlsx')
readxls
# readdf

    Names  Age
0  Ramesh   21
1  suresh   31
2     ram   41